package inobr.eft.formula.lang 
{
	public var ru:Object = {
		'LangCode': 'ru',
		'LangName': 'Русский',
		'StartsWithDivisorError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего одно из чисел начинается с разделителя (1+.1).",
		'StartsWithZeroError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего одно из чисел начинается с нуля (012).",
		'TwoDivisorsInNumberError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего в одном из чисел присутствует два разделителя (1.0.2).",
		'LetterInNumberError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего в одном из чисел присутсвует недопустимый символ.",
		'NotDigitAfterDividerError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего в одном из чисел есть разделитель, но отсутствует дробная часть (10.)",
		'TwoOperatorsError': "В выделенном блоке необходимо исправить ошибку!\nВероятнее всего подряд записано два оператора (++, –+).",
		'DivisionByZero': "В элементе Дробь в знаменателе ноль!",
		'NegativeNumberUnderRoot': "Под знаком корня не может быть отрицательное число!",
		'ZeroNumberInRootPow': "Степень корня не может быть равна 0!",
		'TangentOfNinetyError': "Аргументом тангенса не может быть 90!\nВ этом случае его значение устремляется к бесконечности.",
		'CotangentOfZeroError': "Аргументом котангенса не может быть ноль!\nВ этом случае его значение устремляется к бесконечности.",
		'NegativeNumberInLog': "Под знаком логарифма не может стоять отрицательное число или ноль!",
		'NegativeNumberInLogBase': "В основании логарифма не может стоять отрицательное число или ноль!",
		'OneInLogBase': "В основании логарифма не может стоять единица!",
		'NoArgument': "У функции нет аргумента!\nПроверьте выделенный фрагмент.",
		'IncorrectFormula': "Записанная формула не является верной!\nПопробуйте найти ошибки и исправить их.",
		'CorrectFormula': "Введённая вами формула верна!",
		'SuccessWindowTitle': "Всё верно!",
		'ErrorWindowTitle': "Внимание! Ошибки!"
		};
}